{"class_name": "Sequential", "keras_version": "1.1.2", "config": [{"class_name": "Lambda", "config": {"name": "lambda_1", "output_shape_type": "raw", "arguments": {}, "batch_input_shape": [null, 96, 320, 3], "function_type": "lambda", "output_shape": null, "trainable": true, "function": ["\u00e3\u0001\u0000\u0000\u0000\u0000\u0000\u0000\u0000\u0001\u0000\u0000\u0000\u0002\u0000\u0000\u0000C\u0000\u0000\u0000s\f\u0000\u0000\u0000|\u0000\u0000d\u0001\u0000\u001bd\u0002\u0000\u0018S)\u0003Ng\u0000\u0000\u0000\u0000\u0000\u00e0_@\u00e9\u0001\u0000\u0000\u0000\u00a9\u0000)\u0001\u00da\u0001xr\u0002\u0000\u0000\u0000r\u0002\u0000\u0000\u0000\u00fa\u001e<ipython-input-8-016981b40230>\u00da\b<lambda>\u0003\u0000\u0000\u0000s\u0000\u0000\u0000\u0000", null, null], "input_dtype": "float32"}}, {"class_name": "BatchNormalization", "config": {"name": "batchnormalization_1", "epsilon": 1e-05, "axis": -1, "beta_regularizer": null, "trainable": true, "mode": 1, "momentum": 0.99, "gamma_regularizer": null}}, {"class_name": "AveragePooling2D", "config": {"name": "averagepooling2d_1", "pool_size": [2, 2], "strides": [2, 2], "dim_ordering": "tf", "trainable": true, "border_mode": "valid"}}, {"class_name": "Convolution2D", "config": {"init": "normal", "nb_col": 5, "dim_ordering": "tf", "border_mode": "same", "W_constraint": null, "subsample": [1, 1], "name": "convolution2d_1", "nb_filter": 24, "bias": true, "W_regularizer": null, "activation": "linear", "nb_row": 5, "trainable": true, "b_constraint": null, "activity_regularizer": null, "b_regularizer": null}}, {"class_name": "MaxPooling2D", "config": {"name": "maxpooling2d_1", "pool_size": [2, 2], "strides": [2, 2], "dim_ordering": "tf", "trainable": true, "border_mode": "valid"}}, {"class_name": "Convolution2D", "config": {"init": "normal", "nb_col": 5, "dim_ordering": "tf", "border_mode": "same", "W_constraint": null, "subsample": [1, 1], "name": "convolution2d_2", "nb_filter": 32, "bias": true, "W_regularizer": null, "activation": "linear", "nb_row": 5, "trainable": true, "b_constraint": null, "activity_regularizer": null, "b_regularizer": null}}, {"class_name": "MaxPooling2D", "config": {"name": "maxpooling2d_2", "pool_size": [2, 2], "strides": [2, 2], "dim_ordering": "tf", "trainable": true, "border_mode": "valid"}}, {"class_name": "Convolution2D", "config": {"init": "normal", "nb_col": 5, "dim_ordering": "tf", "border_mode": "same", "W_constraint": null, "subsample": [1, 1], "name": "convolution2d_3", "nb_filter": 48, "bias": true, "W_regularizer": null, "activation": "linear", "nb_row": 5, "trainable": true, "b_constraint": null, "activity_regularizer": null, "b_regularizer": null}}, {"class_name": "MaxPooling2D", "config": {"name": "maxpooling2d_3", "pool_size": [2, 2], "strides": [2, 2], "dim_ordering": "tf", "trainable": true, "border_mode": "valid"}}, {"class_name": "Convolution2D", "config": {"init": "normal", "nb_col": 3, "dim_ordering": "tf", "border_mode": "valid", "W_constraint": null, "subsample": [1, 1], "name": "convolution2d_4", "nb_filter": 64, "bias": true, "W_regularizer": null, "activation": "linear", "nb_row": 3, "trainable": true, "b_constraint": null, "activity_regularizer": null, "b_regularizer": null}}, {"class_name": "Convolution2D", "config": {"init": "normal", "nb_col": 3, "dim_ordering": "tf", "border_mode": "valid", "W_constraint": null, "subsample": [1, 1], "name": "convolution2d_5", "nb_filter": 128, "bias": true, "W_regularizer": null, "activation": "linear", "nb_row": 3, "trainable": true, "b_constraint": null, "activity_regularizer": null, "b_regularizer": null}}, {"class_name": "MaxPooling2D", "config": {"name": "maxpooling2d_4", "pool_size": [2, 2], "strides": [2, 2], "dim_ordering": "tf", "trainable": true, "border_mode": "valid"}}, {"class_name": "Flatten", "config": {"name": "flatten_1", "trainable": true}}, {"class_name": "Dropout", "config": {"name": "dropout_1", "trainable": true, "p": 0.5}}, {"class_name": "Dense", "config": {"init": "normal", "output_dim": 512, "activity_regularizer": null, "W_constraint": null, "name": "dense_1", "bias": true, "W_regularizer": null, "activation": "linear", "input_dim": null, "trainable": true, "b_constraint": null, "b_regularizer": null}}, {"class_name": "Dropout", "config": {"name": "dropout_2", "trainable": true, "p": 0.5}}, {"class_name": "Dense", "config": {"init": "normal", "output_dim": 256, "activity_regularizer": null, "W_constraint": null, "name": "dense_2", "bias": true, "W_regularizer": null, "activation": "linear", "input_dim": null, "trainable": true, "b_constraint": null, "b_regularizer": null}}, {"class_name": "Dense", "config": {"init": "normal", "output_dim": 128, "activity_regularizer": null, "W_constraint": null, "name": "dense_3", "bias": true, "W_regularizer": null, "activation": "linear", "input_dim": null, "trainable": true, "b_constraint": null, "b_regularizer": null}}, {"class_name": "Dense", "config": {"init": "normal", "output_dim": 1, "activity_regularizer": null, "W_constraint": null, "name": "dense_4", "bias": true, "W_regularizer": null, "activation": "tanh", "input_dim": null, "trainable": true, "b_constraint": null, "b_regularizer": null}}]}